### Classification Module Exercises
`start`: wednesday, June 29th 2022

In [11]:
from pydataset import data

In [12]:
df_iris = data("iris")
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

**4. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.**

- [ ] print the first 3 rows
- [ ] print the number of rows and columns (shape)
- [ ] print the column names
- [ ] print the data type of each column
- [ ] print the summary statistics for each of the numeric variables

In [13]:
# print the first three (3) rows
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [14]:
# print the number of rows and columns ("shape" method)

df_iris.shape # df shape = (150 'rows', 5 'columns')

(150, 5)

In [15]:
# print the column names

df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [16]:
# print the data type of ea. column 

df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [17]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

----
**5. Read the Table1_CustDetails table from your spreadsheet exercises google sheet into a dataframe named df_google_sheets.**

*Make sure that the spreadsheet is publicly visible under your sharing settings.*

- [ ] assign the first 100 rows to a new dataframe, df_google_sheets_sample
- [ ] print the number of rows of your original dataframe
- [ ] print the first 5 column names
- [ ] print the column names that have a data type of object
- [ ] compute the range for each of the numeric variables

In [18]:
import pandas as pd

sheet_url = 'https://docs.google.com/spreadsheets/d/1d2C6dz1bR-6GxsitV390xgRKdhIPJC6F03NM1KaEgLk/edit#gid=985024948'

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google_sheets = pd.read_csv(csv_export_url)
df_google_sheets.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,tenure
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.0
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.1
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.8
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.6
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.2

In [19]:
# [ ] assign the first 100 rows to a new dataframe, df_google_sheets_sample

df_google_sheets_sample = df_google_sheets.head(100)
df_google_sheets_sample.shape # checks out!

(100, 13)

In [20]:
# [ ] print the number of rows of your original dataframe

df_google_sheets.shape[0] # 7049 rows

7049

In [21]:
# [ ] print the first 5 column names

df_google_sheets.columns[:4]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner'], dtype='object')

In [22]:
# [ ] print the column names that have a data type of object


df_google_sheets.select_dtypes("object").columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [23]:
# [ ] compute the range for each of the numeric variables

numerical_range = df_google_sheets.select_dtypes(include=["int", "float"]).max() - df_google_sheets.select_dtypes(include=["int", "float"]).min()
numerical_range

is_senior_citizen       1.0
phone_service           2.0
internet_service        2.0
contract_type           2.0
monthly_charges       100.5
total_charges        8666.0
tenure                 79.3
dtype: float64

----

**6. Download your spreadsheet exercises google sheet as an excel file (File → Download → Microsoft Excel). Read the Table1_CustDetails worksheet into a dataframe named df_excel.**

- [ ] assign the first 100 rows to a new dataframe, df_excel_sample
- [ ] print the number of rows of your original dataframe
- [ ] print the first 5 column names
- [ ] print the column names that have a data type of object
- [ ] compute the range for each of the numeric variables.

In [24]:
df_excel = pd.read_excel("/Users/mijailmariano/Downloads/telco_29JUN22.xlsx")
df_excel.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,tenure
0,0002-ORFBO,Female,0.0,Yes,Yes,1.0,1.0,1.0,Mailed check,65.6,593.30,No,9.044207
1,0003-MKNFE,Male,0.0,No,No,2.0,1.0,0.0,Mailed check,59.9,542.40,No,9.055092
2,0004-TLHLJ,Male,0.0,No,No,1.0,2.0,0.0,Electronic check,73.9,280.85,Yes,3.800406
3,0011-IGKFF,Male,1.0,Yes,No,1.0,2.0,0.0,Electronic check,98.0,1237.85,Yes,12.631122
4,0013-EXCHZ,Female,1.0,Yes,No,1.0,2.0,0.0,Mailed check,83.9,267.40,Yes,3.187128

In [25]:
# [ ] assign the first 100 rows to a new dataframe, df_excel_sample

df_excel_sample = df_excel.head(100)
len(df_excel_sample) # checks out!

100

In [26]:
# [ ] print the number of rows of your original dataframe

df_excel.shape[0] # 7049 total rows

7049

In [27]:
# [ ] print the first 5 column names

df_excel.columns[:4]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner'], dtype='object')

In [28]:
# [ ] print the column names that have a data type of object

df_excel.select_dtypes(include="object").columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [29]:
# [ ] compute the range for each of the numeric variables

numerical_range = df_excel.select_dtypes(include=["int", "float"]).max() - df_excel.select_dtypes(include=["int", "float"]).min()
numerical_range.round(2)

is_senior_citizen       1.00
phone_service           2.00
internet_service        2.00
contract_type           2.00
monthly_charges       100.50
total_charges        8666.00
tenure                 79.34
dtype: float64

----

**7. Read the data from this google sheet into a dataframe, df_google**

- [ ] print the first 3 rows
- [ ] print the number of rows and columns
- [ ] print the column names
- [ ] print the data type of each column
- [ ] print the summary statistics for each of the numeric variables
- [ ] print the unique values for each of your categorical variables

In [30]:
# getting Google Sheets spreadsheet url 
sheet_url = 'https://docs.google.com/spreadsheets/d/1NPDGUGESbwKRZ92eYl9_J703fMELWfRipma6ftA18EE/edit#gid=341089357'

# replacing key words in url - for access
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

In [31]:
# creating a dataframe from the imported Google Spreadsheet CSV

df_google = pd.read_csv(csv_export_url)

In [32]:
# [ ] print the first 3 rows

df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [33]:
# [ ] print the number of rows and columns

df_google.shape # (891 rows, 12 columns)

(891, 12)

In [34]:
# [ ] print the column names

df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [35]:
# [ ] print the data type of each column

df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [36]:
# [ ] print the summary statistics for each of the numeric variables

df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [37]:
# [ ] print the unique values for each of your categorical variables

df_google.select_dtypes(exclude=["int", "float"]).value_counts(normalize=True)

Name                                Sex     Ticket    Cabin  Embarked
Allen, Miss. Elisabeth Walton       female  24160     B5     S           0.00495
Newsom, Miss. Helen Monypeny        female  11752     D47    S           0.00495
Molson, Mr. Harry Markland          male    113787    C30    S           0.00495
Moor, Master. Meier                 male    392096    E121   S           0.00495
Moor, Mrs. (Beila)                  female  392096    E121   S           0.00495
                                                                          ...
Frolicher, Miss. Hedwig Margaritha  female  13568     B39    C           0.00495
Frolicher-Stehli, Mr. Maxmillian    male    13567     B41    C           0.00495
Fry, Mr. Richard                    male    112058    B102   S           0.00495
Futrelle, Mr. Jacques Heath         male    113803    C123   S           0.00495
Young, Miss. Marie Grice            female  PC 17760  C32    C           0.00495
Length: 202, dtype: float64

-----

**Make a new python module, acquire.py to hold the following data aquisition functions:**

- [ ] Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

- [ ] Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

- [ ] Make a function named get_telco_data that returns the data from the telco_churn database in SQL. In your SQL, be sure to join all 4 tables together, so that the resulting dataframe contains all the contract, payment, and internet service options. Obtain your data from the Codeup Data Science Database.

- [ ] Once you've got your get_titanic_data, get_iris_data, and get_telco_data functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for the local filename of telco.csv, titanic.csv, or iris.csv. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.

In [50]:
import env
from env import user, host, password, get_connection

In [113]:
# [ ] Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

def get_titanic_data():
    # editing for "caching" exercise
    import os
    filename = "titatic.csv"
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        import pandas as pd # importing pandas inside of the function for any pd related methods or functions
        import pymysql # importing the "pymysql" module within the function itself
        db_url = f'mysql+pymysql://{user}:{password}@{host}/titanic_db'
        df = pd.read_sql("SELECT * FROM passengers", db_url)
        df.to_csv(filename)
        return df

In [114]:
get_titanic_data().head() # function checks out!

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [111]:
# [ ] Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. 
# The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

def get_iris_data():
    # editing for "caching" exercise
    import os
    filename = "iris.csv"
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        import pandas as pd # importing pandas inside of the function for any pd related methods or functions
        import pymysql # importing the "pymysql" module within the function itself
        db_url = f'mysql+pymysql://{user}:{password}@{host}/iris_db'
        query = ''' 
        SELECT * 
        FROM measurements
        RIGHT JOIN species
        USING (species_id)
        '''
        df = pd.read_sql(query, db_url)
        df.to_csv(filename)
        return df

In [112]:
get_iris_data().head() # function checks out!

,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,1,5.1,3.5,1.4,0.2
1,1,setosa,2,4.9,3.0,1.4,0.2
2,1,setosa,3,4.7,3.2,1.3,0.2
3,1,setosa,4,4.6,3.1,1.5,0.2
4,1,setosa,5,5.0,3.6,1.4,0.2

In [115]:
# [ ] Make a function named get_telco_data that returns the data from the telco_churn database in SQL. 
# In your SQL, be sure to join all 4 tables together, so that the resulting dataframe contains all the contract, payment, and internet service options. 
# Obtain your data from the Codeup Data Science Database.

# customers
# internet_service_types
# payment_types and 
# contract_types

def get_telco_data():
    # editing for "caching" exercise
    import os
    filename = "telco.csv"
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        import pandas as pd
        import pymysql
        db_url = f'mysql+pymysql://{user}:{password}@{host}/telco_churn'
        query = ''' 
        SELECT *
        FROM customers
        RIGHT JOIN contract_types using (contract_type_id)
        RIGHT JOIN payment_types using (payment_type_id)
        RIGHT JOIN internet_service_types using (internet_service_type_id)
        '''
        df = pd.read_sql(query, db_url)
        df.to_csv(filename)
        return df

In [116]:
get_telco_data().head() # function checks out!

,internet_service_type_id,internet_service_type,payment_type_id,payment_type,contract_type_id,contract_type,customer_id,gender,senior_citizen,partner,...,online_security,online_backup,device_protection,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn
0,1,DSL,2,Mailed check,2,One year,0002-ORFBO,Female,0,Yes,...,No,Yes,No,Yes,Yes,No,Yes,65.60,593.3,No
1,1,DSL,2,Mailed check,1,Month-to-month,0003-MKNFE,Male,0,No,...,No,No,No,No,No,Yes,No,59.90,542.4,No
2,1,DSL,4,Credit card (automatic),1,Month-to-month,0013-MHZWF,Female,0,No,...,No,No,No,Yes,Yes,Yes,Yes,69.40,571.45,No
3,1,DSL,1,Electronic check,1,Month-to-month,0015-UOCOJ,Female,1,No,...,Yes,No,No,No,No,No,Yes,48.20,340.35,No
4,1,DSL,2,Mailed check,3,Two year,0016-QLJIS,Female,0,Yes,...,Yes,Yes,Yes,Yes,Yes,Yes,Yes,90.45,5957.9,No

----

**[ ] Once you've got your get_titanic_data, get_iris_data, and get_telco_data functions written, now it's time to add caching to them.**

* To do this, edit the beginning of the function to check for the local filename of telco.csv, titanic.csv, or iris.csv. 

* If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.

        done!

        end: wednesday, June 29th 2022